## Series

In [1]:
import numpy as np
import pandas as pd

In [2]:
labels=['a','b','c']
my_d=[20,30,40]
arrr=np.array(my_d)
d={'a':20,'b':30,'c':40}

In [3]:
pd.Series(data=my_d)  #capital S

0    20
1    30
2    40
dtype: int64

In [4]:
pd.Series(data=my_d,index=labels)

a    20
b    30
c    40
dtype: int64

In [5]:
pd.Series(arrr)

0    20
1    30
2    40
dtype: int32

In [6]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [7]:
pd.Series(d)

a    20
b    30
c    40
dtype: int64

In [8]:
ser1=pd.Series([5,6,7,8],['India','Usa',"brazil",'Japan'])       #  ([data],[Index])

In [9]:
ser1

India     5
Usa       6
brazil    7
Japan     8
dtype: int64

In [10]:
ser2=pd.Series((1,2,3,4),['India','Usa',"Itlay","Japan"])
ser2

India    1
Usa      2
Itlay    3
Japan    4
dtype: int64

In [11]:
ser1+ser2   #converted into float     #same index added

India      6.0
Itlay      NaN
Japan     12.0
Usa        8.0
brazil     NaN
dtype: float64

## DataFrame      Part-1

In [12]:
import numpy as np
import pandas as pd

In [13]:
np.random.seed(101)

In [14]:
df=pd.DataFrame(np.random.randn(4,3),[1,2,3,4],['A','B','C'])   #capital D and F
df

          A         B         C
1  2.706850  0.628133  0.907969
2  0.503826  0.651118 -0.319318
3 -0.848077  0.605965 -2.018168
4  0.740122  0.528813 -0.589001

In [15]:
df["A"]  # Series returned

1    2.706850
2    0.503826
3   -0.848077
4    0.740122
Name: A, dtype: float64

In [16]:
df[["A","C"]]  # DataFrame returned

          A         C
1  2.706850  0.907969
2  0.503826 -0.319318
3 -0.848077 -2.018168
4  0.740122 -0.589001

In [17]:
df["new"]=np.random.randn()  # adding a new column  # just imagine its already there

In [18]:
df

          A         B         C       new
1  2.706850  0.628133  0.907969  0.188695
2  0.503826  0.651118 -0.319318  0.188695
3 -0.848077  0.605965 -2.018168  0.188695
4  0.740122  0.528813 -0.589001  0.188695

In [19]:
df.drop("new",axis=1)     #axis to be used for drop         # axis=1 for column

          A         B         C
1  2.706850  0.628133  0.907969
2  0.503826  0.651118 -0.319318
3 -0.848077  0.605965 -2.018168
4  0.740122  0.528813 -0.589001

In [20]:
df.drop(4,axis=0)   #axis specification not required because "axis=0" is default

          A         B         C       new
1  2.706850  0.628133  0.907969  0.188695
2  0.503826  0.651118 -0.319318  0.188695
3 -0.848077  0.605965 -2.018168  0.188695

 NOTICE that new is not deleated because drop function is not permanet and it will only drop for that instance.

In [21]:
df

          A         B         C       new
1  2.706850  0.628133  0.907969  0.188695
2  0.503826  0.651118 -0.319318  0.188695
3 -0.848077  0.605965 -2.018168  0.188695
4  0.740122  0.528813 -0.589001  0.188695

In [22]:
df.drop("new",axis=1,inplace=True) # inpace=Teue used to drop column permanently

In [23]:
df

          A         B         C
1  2.706850  0.628133  0.907969
2  0.503826  0.651118 -0.319318
3 -0.848077  0.605965 -2.018168
4  0.740122  0.528813 -0.589001

In [24]:
df.loc[2]              # selecting row by index name     #returned as Series

A    0.503826
B    0.651118
C   -0.319318
Name: 2, dtype: float64

In [25]:
df.iloc[1]              # by this method we select index position

A    0.503826
B    0.651118
C   -0.319318
Name: 2, dtype: float64

CHECK both the methods and their output

In [26]:
df.loc[2,"B"]

0.6511179479432686

In [27]:
df.loc[[1,2],["A","B"]] # grab a section

          A         B
1  2.706850  0.628133
2  0.503826  0.651118

## DataFrame part-2

# Conditional selection

In [28]:
np.random.seed(101)
df=pd.DataFrame(np.random.randn(4,3),[1,2,3,4],['A','B','C']) 
df

          A         B         C
1  2.706850  0.628133  0.907969
2  0.503826  0.651118 -0.319318
3 -0.848077  0.605965 -2.018168
4  0.740122  0.528813 -0.589001

In [29]:
df>0

       A     B      C
1   True  True   True
2   True  True  False
3  False  True  False
4   True  True  False

In [30]:
df[df>0]  # printed true values only

          A         B         C
1  2.706850  0.628133  0.907969
2  0.503826  0.651118       NaN
3       NaN  0.605965       NaN
4  0.740122  0.528813       NaN

In [31]:
df["A"]>0

1     True
2     True
3    False
4     True
Name: A, dtype: bool

In [32]:
df[df["A"]>0]   # 3rd row not printed because under row 'A' 3 was false

          A         B         C
1  2.706850  0.628133  0.907969
2  0.503826  0.651118 -0.319318
4  0.740122  0.528813 -0.589001

In [33]:
df[df["C"]<0]["B"]   # after the operation we selected a row

2    0.651118
3    0.605965
4    0.528813
Name: B, dtype: float64

In [34]:
df[df["C"]<0][["B","C"]]

          B         C
2  0.651118 -0.319318
3  0.605965 -2.018168
4  0.528813 -0.589001

MULTIPLE CONDITIONS

In [35]:
df[(df["A"]>0) & (df["C"]<0)]       # IF we use AND it will be wrong we have to use & 
                                    # same case for OR we have to use |

          A         B         C
2  0.503826  0.651118 -0.319318
4  0.740122  0.528813 -0.589001

In [38]:
df.reset_index()      # we got new numerical index and previos index converted to a column

   index         A         B         C
0      1  2.706850  0.628133  0.907969
1      2  0.503826  0.651118 -0.319318
2      3 -0.848077  0.605965 -2.018168
3      4  0.740122  0.528813 -0.589001

In [48]:
new_colu="aa bb cc dd".split()       # trick to creat a list
new_colu

['aa', 'bb', 'cc', 'dd']

In [53]:
df['new_c']=new_colu
df

          A         B         C new_c
1  2.706850  0.628133  0.907969    aa
2  0.503826  0.651118 -0.319318    bb
3 -0.848077  0.605965 -2.018168    cc
4  0.740122  0.528813 -0.589001    dd

In [55]:
df.set_index("new_c")   #set column a an  index

              A         B         C
new_c
aa     2.706850  0.628133  0.907969
bb     0.503826  0.651118 -0.319318
cc    -0.848077  0.605965 -2.018168
dd     0.740122  0.528813 -0.589001

In [57]:
df

          A         B         C new_c
1  2.706850  0.628133  0.907969    aa
2  0.503826  0.651118 -0.319318    bb
3 -0.848077  0.605965 -2.018168    cc
4  0.740122  0.528813 -0.589001    dd

## DataFrame Part-3

# Multi-level index

In [58]:
import pandas as pd
import numpy as np

In [68]:
outside="G1 G1 G1 G2 G2 G2".split()
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))

In [70]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [72]:
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [76]:
df=pd.DataFrame(np.random.randn(6,2),hier_index,["A","B"])

In [78]:
df

             A         B
G1 1 -0.116773  1.901755
   2  0.238127  1.996652
   3 -0.993263  0.196800
G2 1 -1.136645  0.000366
   2  1.025984 -0.156598
   3 -0.031579  0.649826

In [81]:
df.loc["G1"]

          A         B
1 -0.116773  1.901755
2  0.238127  1.996652
3 -0.993263  0.196800

In [83]:
df.loc["G2"].loc[2]

A    1.025984
B   -0.156598
Name: 2, dtype: float64

In [89]:
df.index.names=["Index",'huh']
df

                  A         B
Index huh
G1    1   -0.116773  1.901755
      2    0.238127  1.996652
      3   -0.993263  0.196800
G2    1   -1.136645  0.000366
      2    1.025984 -0.156598
      3   -0.031579  0.649826

In [91]:
df.loc["G1"].loc[2]["B"]   # grab  a value

1.9966522853695665

In [92]:
df.xs(2,level="huh") # returned where level =2 under huh

              A         B
Index
G1     0.238127  1.996652
G2     1.025984 -0.156598